CIFAR1-LUT
____________________________________________________________________________________________________________________________________________
Layer (type)                                            Output Shape                                            Param #       
============================================================================================================================================
binary_conv_1 (binary_conv)                             (None, Dimension(30), Dimension(30), Dimension(64))     3538          
____________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)              (None, Dimension(30), Dimension(30), Dimension(64))     256           
____________________________________________________________________________________________________________________________________________
residual_sign_1 (Residual_sign)                         (2, (None, Dimension(30), Dimension(30), Dimension(64)) 2             
____________________________________________________________________________________________________________________________________________
binary_conv_2 (binary_conv)                             (2, Dimension(28), Dimension(28), Dimension(64))        75457         
____________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)              (2, Dimension(28), Dimension(28), Dimension(64))        256           
____________________________________________________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)                          (2, Dimension(14), Dimension(14), Dimension(64))        0             
____________________________________________________________________________________________________________________________________________
residual_sign_2 (Residual_sign)                         (2, (2, Dimension(14), Dimension(14), Dimension(64)))   2             
____________________________________________________________________________________________________________________________________________
binary_conv_3 (binary_conv)                             (2, Dimension(12), Dimension(12), Dimension(128))       149185        
____________________________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)              (2, Dimension(12), Dimension(12), Dimension(128))       512           
____________________________________________________________________________________________________________________________________________
residual_sign_3 (Residual_sign)                         (2, (2, Dimension(12), Dimension(12), Dimension(128)))  2             
____________________________________________________________________________________________________________________________________________
binary_conv_4 (binary_conv)                             (2, Dimension(10), Dimension(10), Dimension(128))       298369        
____________________________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)              (2, Dimension(10), Dimension(10), Dimension(128))       512           
____________________________________________________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)                          (2, Dimension(5), Dimension(5), Dimension(128))         0             
____________________________________________________________________________________________________________________________________________
residual_sign_4 (Residual_sign)                         (2, (2, Dimension(5), Dimension(5), Dimension(128)))    2             
____________________________________________________________________________________________________________________________________________
binary_conv_5 (binary_conv)                             (2, Dimension(3), Dimension(3), Dimension(256))         593281        
____________________________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)              (2, Dimension(3), Dimension(3), Dimension(256))         1024          
____________________________________________________________________________________________________________________________________________
residual_sign_5 (Residual_sign)                         (2, (2, Dimension(3), Dimension(3), Dimension(256)))    2             
____________________________________________________________________________________________________________________________________________
binary_conv_6 (binary_conv)                             (2, Dimension(1), Dimension(1), Dimension(256))         19471105      
____________________________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)              (2, Dimension(1), Dimension(1), Dimension(256))         1024          
____________________________________________________________________________________________________________________________________________
my_flat_1 (my_flat)                                     (2, 256)                                                0             
____________________________________________________________________________________________________________________________________________
residual_sign_6 (Residual_sign)                         (2, (2, 256))                                           2             
____________________________________________________________________________________________________________________________________________
binary_dense_1 (binary_dense)                           (2, 512)                                                262913        
____________________________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)              (2, 512)                                                2048          
____________________________________________________________________________________________________________________________________________
residual_sign_7 (Residual_sign)                         (2, (2, 512))                                           2             
____________________________________________________________________________________________________________________________________________
binary_dense_2 (binary_dense)                           (2, 512)                                                525825        
____________________________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)              (2, 512)                                                2048          
____________________________________________________________________________________________________________________________________________
residual_sign_8 (Residual_sign)                         (2, (2, 512))                                           2             
____________________________________________________________________________________________________________________________________________
binary_dense_3 (binary_dense)                           (2, 10)                                                 11777         
____________________________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)              (2, 10)                                                 40            
____________________________________________________________________________________________________________________________________________
activation_1 (Activation)                               (2, 10)                                                 0             
============================================================================================================================================
Total params: 21,399,186
Trainable params: 19,831,277
Non-trainable params: 1,567,909
____________________________________________________________________________________________________________________________________________
(lutnet) lab611@lab611-PowerEdge-R730-2:~/workspace/dezheng$ 


############################################################################################################################################
REB
____________________________________________________________________________________________________________________________________________
Layer (type)                                            Output Shape                                            Param #       
============================================================================================================================================
binary_conv_1 (binary_conv)                             (None, Dimension(30), Dimension(30), Dimension(64))     3538          
____________________________________________________________________________________________________________________________________________
batch_normalization_1 (BatchNormalization)              (None, Dimension(30), Dimension(30), Dimension(64))     256           
____________________________________________________________________________________________________________________________________________
residual_sign_1 (Residual_sign)                         (2, (None, Dimension(30), Dimension(30), Dimension(64)) 2             
____________________________________________________________________________________________________________________________________________
binary_conv_2 (binary_conv)                             (2, Dimension(28), Dimension(28), Dimension(64))        75457         
____________________________________________________________________________________________________________________________________________
batch_normalization_2 (BatchNormalization)              (2, Dimension(28), Dimension(28), Dimension(64))        256           
____________________________________________________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)                          (2, Dimension(14), Dimension(14), Dimension(64))        0             
____________________________________________________________________________________________________________________________________________
residual_sign_2 (Residual_sign)                         (2, (2, Dimension(14), Dimension(14), Dimension(64)))   2             
____________________________________________________________________________________________________________________________________________
binary_conv_3 (binary_conv)                             (2, Dimension(12), Dimension(12), Dimension(128))       149185        
____________________________________________________________________________________________________________________________________________
batch_normalization_3 (BatchNormalization)              (2, Dimension(12), Dimension(12), Dimension(128))       512           
____________________________________________________________________________________________________________________________________________
residual_sign_3 (Residual_sign)                         (2, (2, Dimension(12), Dimension(12), Dimension(128)))  2             
____________________________________________________________________________________________________________________________________________
binary_conv_4 (binary_conv)                             (2, Dimension(10), Dimension(10), Dimension(128))       298369        
____________________________________________________________________________________________________________________________________________
batch_normalization_4 (BatchNormalization)              (2, Dimension(10), Dimension(10), Dimension(128))       512           
____________________________________________________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)                          (2, Dimension(5), Dimension(5), Dimension(128))         0             
____________________________________________________________________________________________________________________________________________
residual_sign_4 (Residual_sign)                         (2, (2, Dimension(5), Dimension(5), Dimension(128)))    2             
____________________________________________________________________________________________________________________________________________
binary_conv_5 (binary_conv)                             (2, Dimension(3), Dimension(3), Dimension(256))         593281        
____________________________________________________________________________________________________________________________________________
batch_normalization_5 (BatchNormalization)              (2, Dimension(3), Dimension(3), Dimension(256))         1024          
____________________________________________________________________________________________________________________________________________
residual_sign_5 (Residual_sign)                         (2, (2, Dimension(3), Dimension(3), Dimension(256)))    2             
____________________________________________________________________________________________________________________________________________
binary_conv_6 (binary_conv)                             (2, Dimension(1), Dimension(1), Dimension(256))         1186561       
____________________________________________________________________________________________________________________________________________
batch_normalization_6 (BatchNormalization)              (2, Dimension(1), Dimension(1), Dimension(256))         1024          
____________________________________________________________________________________________________________________________________________
my_flat_1 (my_flat)                                     (2, 256)                                                0             
____________________________________________________________________________________________________________________________________________
residual_sign_6 (Residual_sign)                         (2, (2, 256))                                           2             
____________________________________________________________________________________________________________________________________________
binary_dense_1 (binary_dense)                           (2, 512)                                                262913        
____________________________________________________________________________________________________________________________________________
batch_normalization_7 (BatchNormalization)              (2, 512)                                                2048          
____________________________________________________________________________________________________________________________________________
residual_sign_7 (Residual_sign)                         (2, (2, 512))                                           2             
____________________________________________________________________________________________________________________________________________
binary_dense_2 (binary_dense)                           (2, 512)                                                525825        
____________________________________________________________________________________________________________________________________________
batch_normalization_8 (BatchNormalization)              (2, 512)                                                2048          
____________________________________________________________________________________________________________________________________________
residual_sign_8 (Residual_sign)                         (2, (2, 512))                                           2             
____________________________________________________________________________________________________________________________________________
binary_dense_3 (binary_dense)                           (2, 10)                                                 11777         
____________________________________________________________________________________________________________________________________________
batch_normalization_9 (BatchNormalization)              (2, 10)                                                 40            
____________________________________________________________________________________________________________________________________________
activation_1 (Activation)                               (2, 10)                                                 0             
============================================================================================================================================
Total params: 3,114,642
Trainable params: 1,546,733
Non-trainable params: 1,567,909
____________________________________________________________________________________________________________________________________________